Revit 2024 API
SelectionChangedEventArgs.GetDocument Method
 Returns the document associated with this event.
Namespace: Autodesk.Revit.UI.Events
Assembly: RevitAPIUI (in RevitAPIUI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2023
Syntax
C#
public Document GetDocument()
Visual Basic
Public Function GetDocument As Document
Visual C++
public:
Document^ GetDocument()
See Also
SelectionChangedEventArgs Class
Autodesk.Revit.UI.Events Namespace